runs/stateful/full_paper/exp1_ttft_reduction_llama3_vllm/vllm_runs/meta-llama_Meta-Llama-3-8B-Instruct/ctx2048_out64_a16_b8_s0/vllm_bench_raw.txt
INFO 05-04 23:41:49 [scheduler.py:216] Chunked prefill is enabled with max_num_batched_tokens=2048.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x1478118611c0>, seed=0, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=2048, random_output_len=64, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=18000, endpoint='/v1/completions', header=None, max_concurrency=None, model='meta-llama/Meta-Llama-3-8B-Instruct', tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-a7cfc792-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
INFO 05-04 23:41:50 [datasets.py:613] Sampling input_len from [2047, 2047] and output_len from [64, 64]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Benchmark duration (s):                  3.46      
Total input tokens:                      65504     
Total generated tokens:                  2048      
Request throughput (req/s):              9.25      
Output token throughput (tok/s):         591.96    
Peak output token throughput (tok/s):    946.00    
Peak concurrent requests:                32.00     
Total Token throughput (tok/s):          19525.36  
---------------Time to First Token----------------
Mean TTFT (ms):                          1477.00   
Median TTFT (ms):                        1461.21   
P99 TTFT (ms):                           2775.19   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.18     
Median TPOT (ms):                        29.50     
P99 TPOT (ms):                           47.04     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.18     
Median ITL (ms):                         11.42     
P99 ITL (ms):                            90.97     
==================================================

/scratch/djy8hg/env/saa_vllm_env/lib/python3.11/site-packages/transformers/utils/hub.py:110: FutureWarning: Using `TRANSFORMERS_CACHE` is deprecated and will be removed in v5 of Transformers. Use `HF_HOME` instead.
  warnings.warn(

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:06 remaining
 |          | 00:00 elapsed, 127:01:55 remaining

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:03<01:37,  3.16s/it]
 31%|███▏      | 10/32 [00:03<00:05,  4.20it/s]
 66%|██████▌   | 21/32 [00:03<00:01, 10.31it/s]
100%|██████████| 32/32 [00:03<00:00,  9.25it/s]